---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkBoundariesVaryOptionSeparate
source: html/8e04df89-1ea3-4e04-5e19-41af26bef00e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.OptionConflictInLinkBoundariesVaryOptionSeparate Property

Option conflict between rooms in the Revit link '[Link Instance Name]'.\nThe room boundary differs from the apparent boundary in the linked view '[View Name from Link]'.\nTo resolve the issue, open the Revit link file for editing, and use room separation lines to divide the space in the main model.

## Syntax (C#)
```csharp
public static FailureDefinitionId OptionConflictInLinkBoundariesVaryOptionSeparate { get; }
```